{
  "version": "2.0.0-beta.3",
  "resource_version": "2.0.0",
  "Announcement": [
    {
      "title": "2.0更新公告",
      "content": "### 2.0更新内容：\n##注意：自2.0版本之后SRA需要.NET8.0. 这是一次跨版本的更新，您的个人配置将全部失效，请妥善保管数据。\n- 主要更新内容：\n  - 我们已将 UI 从`PySide6`迁移到`Avalonia`, 希望这能为您带来更现代化和更舒适的用户体验。\n  - 现在运行SRA需要安装`.NET 8.0`。如果您未安装，您会在首次运行时收到提示，请按照提示进行安装。\n  - SRA更新器已集成到主程序中，您可以通过主界面直接检查和安装更新。\n  - SRA现在提供了一个命令行界面（CLI），允许高级用户跳过图形化用户界面（GUI）运行SRA，但仍需GUI进行任务配置。\n  - 适配崩铁3.7版本：\n    - 新增饰品提取-西风丛中 可获得套装：永恒之地翁法罗斯/天国@直播间\n    - 饰品提取已经可以连续作战，最大次数为6次。\n    - 拟造花萼（金）与拟造花萼（赤）的最大次数已提升至24。\n    - 凝滞虚影已经可以连续作战，最大次数为8次。\n    - 侵蚀隧洞已经可以连续作战，最大次数为6次。\n    - 历战余响已经可以连续作战，最大次数为3次。\n  - 在进行饰品提取时，现在可以选择是否释放战技入场。\n  - 在进行饰品提取时，现在允许关闭编队检查。\n- 功能调整：\n  - 设置->任务通用设置->线程安全：此选项已经过时，修改它不会有实际效果。SRA现在使用进程来执行任务，以便随时终止。\n  - 设置->常规->开机自启：此选项已经过时，修改它不会有实际效果。SRA需要管理员权限，无法开机自启，请使用系统的计划任务。\n  - 已取消配置方案数量上限，现在您可以创建任意数量的配置方案。您可能需要手动清理不再使用的配置方案的文件。\n  - 原全局配置文件`globals.json`已被弃用，它被拆分为`cache.json`和`settings.json`，分别用于缓存数据和存储应用设置。\n  - 配置方案文件格式已更改，旧版本配置方案将全部失效。\n  - SRA相关文件的存储路径已更改，已经转移到`C:/Users/您的用户名/AppData/Roaming/SRA`目录下。\n- 尚未实现：\n  - 设置->高级->检查文件完整性：此功能尚未实现，未来版本中可能会添加。\n  - 插件系统：插件系统尚未实现，未来版本中可能会添加。\n  - 多语言支持：目前仅支持简体中文，未来版本中可能会添加其他语言支持。\n  - 定时执行任务：此功能尚未实现，未来版本中可能会添加。\n  - 全局热键支持：此功能尚未实现，未来版本中可能会添加。\n  - 多分辨率支持：此功能尚未实现，未来版本中可能会添加。",
      "contentType": "markdown"
    },
    {
      "title": "标题征集活动",
      "content": "### SRA随机标题创意征集令！\n你是否已发现，每次启动SRA时，那变幻莫测的标题总能带来一丝惊喜？从“启动器启动启动器”的巧妙循环，到“坐和放宽”的幽默调侃，每一个标题都是一次小小的冒险。现在，为了让这份乐趣持续升级，我们特此发起——SRA随机标题创意征集活动！\n\n#### 🎉 参与方式大揭秘：\n- 发挥你的创意：构思一个既有趣又独特的随机标题。\n- 追溯灵感之源：简单说明标题的出处或创意背景，无论是冷笑话、双关妙语、网络热梗，还是一句触动心灵的歌词，皆可成为你的灵感源泉。\n- 一键投稿：将你的创意标题及解释，发送至邮箱 yukikage@qq.com，即可参与活动！\n#### 📝 标题要求小贴士：\n- 精炼至上：标题长度需控制在20个字符以内，简洁明了更吸引人。\n- 内容健康：请确保标题中不包含任何敏感、政治倾向或色情等不适当内容，让创意在正能量的轨道上飞扬。\n#### 🌟 期待你的闪光点：\n我们相信，每个人的心中都藏着无数奇思妙想。现在，是时候让它们闪耀登场了！无论是天马行空的想象，还是贴近生活的幽默，只要你的标题能够触动人心，就有可能成为SRA下一次启动时的亮点！\n\n快来加入我们，一起为SRA的世界增添更多色彩与乐趣吧！期待你的创意风暴，让每一次启动都成为一次难忘的体验！🚀",
      "contentType": "markdown"
    }
  ],
  "Announcement.DoNotShowAgain": false,
  "Proxys": [
    "https://tvv.tw/",
    "https://github.moeyy.xyz/",
    "https://ghproxy.1888866.xyz/",
    "https://github.chenc.dev/",
    ""
  ],
  "channel": "stable"
}